a52dec
aalib
accounts-qml-module
accountsservice
acl
adobe-source-han-sans-cn-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-kr-fonts
adwaita-icon-theme
alacritty
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
anydesk-bin
aom
arc-gtk-theme-eos
arc-x-icons-theme
archlinux-keyring
argon2
at-spi2-atk
at-spi2-core
atk
atkmm
attica
attr
audit
autoconf
autoconf-archive
automake
avahi
b43-fwcutter
babl
base
bash
bash-completion
beep
bind
binutils
bison
blas
bless
bluez-libs
boomer-git
boost-libs
box2d
breeze
breeze-icons
bridge-utils
brotli
bspwm
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cantarell-fonts
capitaine-cursors
cava
ccls
cdparanoia
chaotic-keyring
chaotic-mirrorlist
checkbashisms
chromaprint
chrpath
cifs-utils
clang
clucene
cmake
colord
compiler-rt
containerd
convertlit
coreutils
cpupower
cryptsetup
curl
cursor-theme-macos-big-sur
dav1d
db
dbus
dbus-glib
dbus-python
dconf
debuginfod
desktop-file-utils
device-mapper
dhclient
dialog
diffutils
ding-libs
discord-canary
discount
djvulibre
dkms
dmidecode
dmraid
dnsmasq
dnssec-anchors
docbook-xml
docbook-xsl
docker
dosfstools
double-conversion
downgrade
dtc
duf
duktape
dunst
e2fsprogs
ebook-tools
editorconfig-core-c
edk2-ovmf
efibootmgr
efitools
efivar
egl-wayland
eglexternalplatform
ell
emacs
enchant
endeavouros-keyring
endeavouros-mirrorlist
endeavouros-skel-default
endeavouros-skel-xfce4
endeavouros-theming
endeavouros-xfce4-terminal-colors
eos-apps-info
eos-bash-shared
eos-hooks
eos-log-tool
eos-quickstart
eos-rankmirrors
eos-translations
eos-update-notifier
ethtool
exfatprogs
exiv2
exo
expat
f2fs-tools
faac
faad2
fakeroot
feh
ffcall
ffmpeg
ffmpeg4.4
ffmpegthumbnailer
fftw
figlet
file
file-roller
filesystem
findutils
firefox
fish
flac
flameshot
flex
florence
fluidsynth
fontconfig
frameworkintegration
freeglut
freetype2
frei0r-plugins
fribidi
fsarchiver
fuse-common
fuse2
fuse3
fzf
galculator
garcon
gavl
gawk
gc
gcc
gcc-libs
gcr
gd
gdbm
gdk-pixbuf2
gegl
geoip
geoip-database
gettext
ghostscript
giflib
gifsicle
gimp
giph
git
github-cli
glances
glfw-x11
glib-networking
glib2
glib2-docs
glibc
glibmm
glslang
glu
gmp
gnome-common
gnome-doc-utils
gnome-keyring
gnome-themes-extra
gnu-netcat
gnupg
gnutls
gobject-introspection-runtime
gpgme
gpm
gptfdisk
graphene
graphite
graphviz
grep
groff
grub
grub-tools
grub2-theme-endeavouros
gsettings-desktop-schemas
gsfonts
gsl
gsm
gspell
gssdp
gssproxy
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gst-plugins-ugly
gstreamer
gtk-doc
gtk-sharp-2
gtk-update-icon-cache
gtk2
gtk3
gtkglext
gtkmm3
gtksourceview3
gtksourceview4
gts
gucharmap
guile
gupnp
gupnp-igd
guvcview
guvcview-common
gvfs
gvfs-afc
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-smb
gzip
haguichi
harfbuzz
harfbuzz-icu
haveged
hdparm
heroku-cli-bin
hicolor-icon-theme
hidapi
htop
http-parser
hunspell
hwdata
hwdetect
hwinfo
hwloc
hyphen
iana-etc
icu
ijs
imagemagick
imath
imlib2
inetutils
iniparser
intel-ucode
intltool
inxi
iproute2
iptables
iputils
ipw2100-fw
ipw2200-fw
iso-codes
itstool
iw
iwd
jansson
jasper
java-runtime-common
jbig2dec
jemalloc
jfsutils
jq
jre-openjdk
jre-openjdk-headless
js78
json-c
json-glib
jsoncpp
kaccounts-integration
kactivities
karchive
kauth
kbd
kbookmarks
kcmutils
kcodecs
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kdeclarative
kdecoration
kded
kdenlive
keyutils
kfilemetadata
kglobalaccel
kguiaddons
khtml
ki18n
kiconthemes
kile
kinit
kio
kirigami2
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kjs
kmod
knewstuff
knotifications
knotifyconfig
kpackage
kparts
kpty
krb5
kservice
ktexteditor
ktextwidgets
kvantum
kwallet
kwayland
kwidgetsaddons
kwindowsystem
kxmlgui
l-smash
lame
lapack
latex-mk
lcms2
ldb
ldns
lemonbar-git
lensfun
less
lib32-alsa-lib
lib32-alsa-plugins
lib32-amdvlk
lib32-brotli
lib32-bzip2
lib32-curl
lib32-e2fsprogs
lib32-expat
lib32-gcc-libs
lib32-glibc
lib32-icu
lib32-keyutils
lib32-krb5
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libpciaccess
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libunistring
lib32-libunwind
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxdamage
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nspr
lib32-nss
lib32-openssl
lib32-p11-kit
lib32-readline
lib32-sqlite
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libabw
libaccounts-glib
libaccounts-qt
libaio
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libavtp
libb2
libblockdev
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcaca
libcacard
libcanberra
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcolord
libconfig
libcups
libcurl-gnutls
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libdca
libde265
libdrm
libdv
libdvdcss
libdvdnav
libdvdread
libe-book
libebur128
libedit
libelf
libepoxy
libepubgen
libetonyek
libev
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfreeaptx
libfreehand
libgcrypt
libgdiplus
libgexiv2
libgit2
libglvnd
libgme
libgnomekbd
libgpg-error
libgphoto2
libgsf
libgtop
libgudev
libgusb
libhandy
libheif
libibus
libice
libid3tag
libidn
libidn2
libiec61883
libimobiledevice
libindicator-gtk3
libinih
libinput
libinstpatch
libisl
libixion
libjpeg-turbo
libkate
libkexiv2
libkeybinder3
libksba
liblangtag
libldac
libldap
liblqr
liblrdf
libltc
libluv
libmanette
libmaxminddb
libmbim
libmd
libmfx
libmicrodns
libmicrohttpd
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspub
libmtp
libmwaw
libmypaint
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnumbertext
libodfgen
libogg
libomxil-bellagio
libopenmpt
libopenraw
liborcus
libotf
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpeas
libpgm
libpipeline
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqmi
libqrtr-glib
libqxp
libraqm
libraw
libraw1394
libreoffice-fresh
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsidplay
libsigc++
libsigsegv
libslirp
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libspiro
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libsysprof-capture
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtorrent-rasterbar
libunistring
libunwind
liburcu
liburing
libusb
libusbmuxd
libutempter
libuv
libva
libvdpau
libverto
libvisio
libvisual
libvorbis
libvpx
libvterm01
libwacom
libwebp
libwmf
libwnck3
libwpd
libwpe
libwpg
libwps
libx11
libx86emu
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmu
libxpm
libxpresent
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
libzmf
licenses
lightdm
lightdm-slick-greeter
lilv
linux
linux-api-headers
linux-atm
linux-firmware
linux-firmware-whence
linux-headers
lld
llvm-libs
lm_sensors
lmdb
logmein-hamachi
logrotate
lolcat
lpsolve
lsb-release
lsof
lsscsi
lttng-ust
lua
lua-language-server
lua53
luajit
luit
lv2
lvm2
lxappearance
lz4
lzo
m17n-db
m17n-lib
m4
mailcap
make
mallard-ducktype
man-db
man-pages
mbedtls
md4c
mdadm
media-player-info
meld
mesa
mesa-utils
meson
metis
microsoft-edge-stable-bin
minecraft-launcher
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mkinitcpio-nfs-utils
mkinitcpio-openswap
mlocate
mlt
mobile-broadband-provider-info
modemmanager
mono
mpfr
mpg123
mpv
msgpack-c
mtdev
mtools
mujs
multipath-tools
mypaint-brushes1
nano
nano-syntax-highlighting
nasm
nbd
ncurses
ndctl
ndisc6
neofetch
neon
neovim
neovim-qt
net-tools
netctl
netpbm
netstat-nat
nettle
network-manager-applet
networkmanager
networkmanager-openvpn
nfs-utils
nfsidmap
nilfs-utils
nim
ninja
nm-connection-editor
nmap
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-extra
npm
npth
nspr
nss
nss-mdns
ntfs-3g
ntp
numactl
nvidia-dkms
nvidia-installer-common
nvidia-installer-db
nvidia-installer-dkms
nvidia-utils
nvim-packer-git
nvtop
oath-toolkit
obs-studio
okular
oniguruma
openal
openconnect
opencore-amr
opendesktop-fonts
openexr
openjpeg2
openmpi
openpmix
openresolv
openssh
openssl
openssl-1.0
openvpn
opus
orc
os-prober
otf-font-awesome
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pacutils
pahole
pam
pambase
pango
pangomm
paper-icon-theme
parallel
parole
parted
paru
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
pcurses
perl
perl-clone
perl-encode-locale
perl-error
perl-exporter-tiny
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-io-socket-ssl
perl-libwww
perl-list-moreutils
perl-list-moreutils-xs
perl-lwp-mediatypes
perl-lwp-protocol-https
perl-mailtools
perl-mozilla-ca
perl-net-http
perl-net-ssleay
perl-term-readline-gnu
perl-term-shellui
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
perl-xml-writer
pfetch-git
phonon-qt5
phonon-qt5-gstreamer
picom
pinentry
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
pixman
pkcs11-helper
pkgconf
pkgfile
pod2man
polkit
polkit-gnome
polkit-qt5
polybar
poppler
poppler-data
poppler-glib
poppler-qt5
popt
portaudio
postgresql
postgresql-libs
postman-bin
potrace
power-profiles-daemon
powershell
ppp
pptpclient
procps-ng
psmisc
purpose
pv
pyright
python
python-anytree
python-appdirs
python-attrs
python-cachecontrol
python-cachy
python-cairo
python-certifi
python-cffi
python-chardet
python-cleo
python-clikit
python-colorama
python-commonmark
python-contextlib2
python-crashtest
python-cryptography
python-defusedxml
python-distlib
python-distro
python-dnspython
python-docutils
python-entrypoints
python-filelock
python-future
python-gobject
python-html5lib
python-idna
python-importlib-metadata
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jedi
python-jeepney
python-jsonschema
python-keyring
python-lark-parser
python-lockfile
python-lsp-jsonrpc
python-lsp-server
python-lxml
python-markdown
python-more-itertools
python-msgpack
python-nspektr
python-ordered-set
python-packaging
python-parso
python-pastel
python-pep517
python-pexpect
python-pip
python-pkginfo
python-platformdirs
python-pluggy
python-ply
python-poetry
python-poetry-core
python-progress
python-psutil
python-ptyprocess
python-pycparser
python-pygments
python-pylev
python-pyopenssl
python-pyparsing
python-pyrsistent
python-requests
python-requests-toolbelt
python-resolvelib
python-retrying
python-rich
python-secretstorage
python-setuptools
python-shellingham
python-shiboken2
python-shtab
python-six
python-tenacity
python-termcolor
python-toml
python-tomli
python-tomlkit
python-trove-classifiers
python-typing_extensions
python-ujson
python-urllib3
python-validate-pyproject
python-virtualenv
python-webencodings
python-zipp
python2
python2-libxml2
qbittorrent
qcustomplot
qemu-audio-alsa
qemu-audio-dbus
qemu-audio-jack
qemu-audio-oss
qemu-audio-pa
qemu-audio-sdl
qemu-audio-spice
qemu-block-curl
qemu-block-dmg
qemu-block-nfs
qemu-block-ssh
qemu-chardev-spice
qemu-common
qemu-desktop
qemu-hw-display-qxl
qemu-hw-display-virtio-gpu
qemu-hw-display-virtio-gpu-gl
qemu-hw-display-virtio-gpu-pci
qemu-hw-display-virtio-gpu-pci-gl
qemu-hw-display-virtio-vga
qemu-hw-display-virtio-vga-gl
qemu-hw-s390x-virtio-gpu-ccw
qemu-hw-usb-host
qemu-hw-usb-redirect
qemu-hw-usb-smartcard
qemu-img
qemu-pr-helper
qemu-system-x86
qemu-tools
qemu-ui-curses
qemu-ui-dbus
qemu-ui-egl-headless
qemu-ui-gtk
qemu-ui-opengl
qemu-ui-sdl
qemu-ui-spice-app
qemu-ui-spice-core
qemu-vhost-user-gpu
qemu-virtiofsd
qhexedit2
qrencode
qscintilla-qt5
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-location
qt5-multimedia
qt5-networkauth
qt5-quickcontrols
qt5-quickcontrols2
qt5-script
qt5-speech
qt5-svg
qt5-translations
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-x11extras
qt5ct
qt6-base
qt6-declarative
qt6-svg
qt6-translations
qt6ct
ranger
rapidjson
raptor
rarian
rasqal
rav1e
re2
readline
rebuild-detector
redland
reflector
reflector-simple
reiserfsprogs
rest
rhash
ristretto
rnnoise
rofi
rp-pppoe
rpcbind
rsync
rtmpdump
rubberband
ruby
ruby-diff-lcs
ruby-irb
ruby-manpages
ruby-optimist
ruby-paint
ruby-psych
ruby-rainbow
ruby-rdoc
ruby-reline
ruby-rspec
ruby-rspec-core
ruby-rspec-expectations
ruby-rspec-mocks
ruby-rspec-support
ruby-stringio
ruby-term-ansicolor
ruby-tins
rubygems
run-parts
runc
rust
rust-analyzer
rust-src
s-nail
sbc
sdl12-compat
sdl2
sdl2_image
seabios
seatd
sed
semver
serd
sg3_utils
shaderc
shadow
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
slang
smartmontools
smbclient
snappy
sof-firmware
solid
sonnet
sord
sound-theme-freedesktop
soundtouch
spandsp
speex
speexdsp
spice
spirv-tools
spotify
sqlcipher
sqlite
sqlitebrowser
sratom
srt
sshfs
starship
startup-notification
steam
stoken
strace
sudo
suitesparse
svt-av1
svt-hevc
sway
swaybg
sxhkd
syndication
syntax-highlighting
sysfsutils
systemd
systemd-libs
systemd-sysvcompat
t1lib
taglib
talloc
tar
tcc
tcl
tdb
telegram-desktop-bin
tevent
texinfo
texlive-bin
texlive-core
thin-provisioning-tools
threadweaver
thunar
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
tldr
tllocalmgr-git
tmate
tor
tpm2-tss
tracker3
tree
tree-sitter
tslib
ttc-iosevka
ttc-iosevka-ss14
ttf-arphic-ukai
ttf-arphic-uming
ttf-baekmuk
ttf-bitstream-vera
ttf-borg-sans-mono
ttf-carlito
ttf-cascadia-code
ttf-cormorant
ttf-crimson
ttf-crimson-pro
ttf-crimson-pro-variable
ttf-croscore
ttf-dejavu
ttf-droid
ttf-eurof
ttf-fantasque-sans-mono
ttf-fira-code
ttf-fira-mono
ttf-fira-sans
ttf-font-awesome
ttf-font-awesome-4
ttf-freebanglafont
ttf-google-fonts-git
ttf-hack
ttf-hanazono
ttf-hannom
ttf-ibm-plex
ttf-inconsolata
ttf-indic-otf
ttf-input
ttf-ionicons
ttf-iosevka-git
ttf-iosevka-nerd
ttf-jetbrains-mono
ttf-joypixels
ttf-juliamono
ttf-junicode
ttf-khmer
ttf-liberation
ttf-linux-libertine
ttf-linux-libertine-g
ttf-mac-fonts
ttf-merriweather
ttf-merriweather-sans
ttf-meslo-nerd-font-powerlevel10k
ttf-monofur
ttf-monoid
ttf-ms-fonts
ttf-nerd-fonts-symbols
ttf-opensans
ttf-oswald
ttf-overpass
ttf-proggy-clean
ttf-quintessential
ttf-roboto
ttf-sarasa-gothic
ttf-sazanami
ttf-signika
ttf-symbola
ttf-tibetan-machine
ttf-twemoji
ttf-ubuntu-font-family
ttf-wps-fonts
ttfautohint
tumbler
twolame
tzdata
uchardet
udisks2
unibilium
unrar
unzip
upower
usb_modeswitch
usbmuxd
usbredir
usbutils
util-linux
util-linux-libs
v4l-utils
valgrind
vde2
vid.stab
vim
vim-runtime
virglrenderer
virtualbox
virtualbox-host-dkms
visual-studio-code-bin
vmaf
volume_key
vpnc
vte-common
vte3
vulkan-headers
vulkan-icd-loader
wavpack
wayland
webkit2gtk
webkit2gtk-4.1
webrtc-audio-processing
weechat
welcome
wget
which
whois
wildmidi
wireless-regdb
wireless_tools
wireplumber
wlroots
wmctrl
woff2
wolfssl
wpa_supplicant
wpebackend-fdo
x264
x265
xapp
xbitmaps
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xdg-dbus-proxy
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xdotool
xed
xf86-input-libinput
xfce4-appfinder
xfce4-battery-plugin
xfce4-datetime-plugin
xfce4-mount-plugin
xfce4-netload-plugin
xfce4-notifyd
xfce4-panel
xfce4-power-manager
xfce4-pulseaudio-plugin
xfce4-screensaver
xfce4-screenshooter
xfce4-session
xfce4-settings
xfce4-taskmanager
xfce4-terminal
xfce4-wavelan-plugin
xfce4-weather-plugin
xfce4-whiskermenu-plugin
xfce4-xkb-plugin
xfconf
xfdesktop
xfsprogs
xfwm4
xfwm4-themes
xkeyboard-config
xl2tpd
xmlsec
xorg-fonts-encodings
xorg-iceauth
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xbacklight
xorg-xclipboard
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkill
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xsetroot
xorg-xwayland
xorgproto
xsel
xterm
xvidcore
xxhash
xz
yad-eos
yay
yelp-tools
yelp-xsl
zbar
zenity
zeromq
zimg
zip
zlib
zsh
zstd
zvbi
zxing-cpp
zziplib
